<?php

return [

    'required' => ':attributeを入力してください',
    'email'    => ':attributeはメール形式で入力してください',
    'unique'   => '指定された:attributeは既に登録されています',
    'min'      => [
        'string' => ':attributeは:min文字以上で入力してください', // ★新規会員登録用(FN003-e)
    ],
    'confirmed' => 'パスワードと一致しません', // ★新規会員登録用(FN003-f)

    /*
    |--------------------------------------------------------------------------
    | カスタム属性名
    |--------------------------------------------------------------------------
    | カラム名（項目名）を日本語に翻訳します。
    | 上の「:attribute」の部分に、ここの日本語が自動的に当てはまります。
    */
    'attributes' => [
        'name'     => 'お名前',         // 「お名前を入力してください」になる
        'email'    => 'メールアドレス', // 「メールアドレスを入力してください」になる
        'password' => 'パスワード',     // 「パスワードを入力してください」になる
    ],
];
